Base_Cases_Run_Lubrication/Base_Case_Run/CFD/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 5400;//0.0001; //http://ichrome.com/blogs/archives/342

boundaryField
{
    outlet
    {
        //type 		  zeroGradient;
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    
    freeSurface
    {
    	 type		slip;	
    }
    
    ".*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
